function msg (n, text) {
    console.log (`===== | Задание № ${n} | =====`);
    console.log (text);
    console.log ('');
}

/* №2 (*) 

С помощью цикла найти сумму всех чисел удовлетворяющих: 1. находится в диапазоне [-10; -3] или [1; 25] 2. больше, чем предыдущий элемент массива 
 
Исходный массив: const array = [46, -45, 26, -17, -32, -19, -43, -18, 16, -28, 17, -40, 42, -32, -36, -39, 35, 43, -34, 47, 9, -23, -26, 0, 19, 48, -3, -38, -26, -29, -1, -10, 24, -36, 10, 42, -34, 24, 2, 33, -13, -42, -2, 40, 38, 11, -46, -13, -41, 1]  */ 

function exercise_2 (min = 1, max = 100, hops = 2) {
    //
}

exercise_2();