function msg (n, text) {
    console.log (`===== | Задание № ${n} | =====`);
    console.log (text);
}

/* №2 (*) 

С помощью цикла найти сумму всех чисел удовлетворяющих: 1. находится в диапазоне [-10; -3] или [1; 25] 2. больше, чем предыдущий элемент массива 
 
Исходный массив: const array = [46, -45, 26, -17, -32, -19, -43, -18, 16, -28, 17, -40, 42, -32, -36, -39, 35, 43, -34, 47, 9, -23, -26, 0, 19, 48, -3, -38, -26, -29, -1, -10, 24, -36, 10, 42, -34, 24, 2, 33, -13, -42, -2, 40, 38, 11, -46, -13, -41, 1] */ 

const array = [46, -45, 26, -17, -32, -19, -43, -18, 16, -28, 17, -40, 42, -32, -36, -39, 35, 43, -34, 47, 9, -23, -26, 0, 19, 48, -3, -38, -26, -29, -1, -10, 24, -36, 10, 42, -34, 24, 2, 33, -13, -42, -2, 40, 38, 11, -46, -13, -41, 1];

function exercise_2 (range = [[-10, -3], [1, 25]], condition = null) {
    let sum = 0;
    for (let i = 0; i < array.length; i++) {
        if (!condition && (range[0][0] <= array[i] === array[i] <= range[0][1] || range[1][0] <= array[i] === array[i] <= range[1][1])) {
            sum += array[i];
        }
        else if ((range[0][0] <= array[i] === array[i] <= range[0][1] || range[1][0] <= array[i] === array[i] <= range[1][1]) && (i > 0 && array[i] > array[i - 1])) {
            sum += array[i];
        }
    }
    return sum;
}

msg ('2_1', exercise_3());
msg ('2_2', exercise_2([[-10, -3], [1, 25]], true));