function msg (n, text) {
    console.log (`===== | Задание № ${n} | =====`);
    console.log (text);
}

/* №12 (***) 

С помощью метода splice заменить самую длинную восходящую подпоследовательность массива на ее реверсивную версию. 
 
Исходный массив: const array = [25, 54, 17, 12, 9, 2, 31, 97, 0, 93, 40, 70, 33, 26, 29, 96, 30, 23, 26, 98, 55, 22, 34, 48, 48, 39, 78, 98, 28, 33, 17, 82, 89, 60, 74, 78, 52, 42, 32, 12, 12, 91, 20, 76, 12, 66, 87, 77, 85, 13, 53, 92, 44, 27, 2, 79, 17, 22, 22, 62, 81, 89, 58, 94, 97, 92, 5, 50, 15, 40, 7, 43, 48, 95, 42, 42, 79, 86, 24, 43, 56, 61, 71, 61, 42, 38, 96, 13, 82, 18, 1, 3, 99, 7, 6, 72, 13, 21, 46, 64] */

function exercise_12 () {
    //
}

msg (12, exercise_12());