function msg (n, text) {
    console.log (`===== | Задание № ${n} | =====`);
    console.log (text);
    console.log ('');
}

// https://repl.it/@chl9252/DZ-6-4-6
// https://repl.it/@Kocherov_M/06-04-06

/* №4 (*)

  - При нажатии на кнопку `Отправить` должно происходить следующее:
      - в начало списка сообщений должно быть добавлено  новое сообщение из `textarea` по примеру. В новом сообщение должна быть указанна служебная информация: время и автор,
      - `textarea` должно очиститься,
      - пустое сообщение нельзя отправить в добавленные. */

function exercise_4 () {
    //
}

msg (4, exercise_4());