function msg (n, text) {
    console.log (`===== | Задание № ${n} | =====`);
    console.log (text);
    console.log ('');
}

// https://repl.it/@chl9252/DZ-5-4

/* №4 (***)

  - Создайте класс `Massiv`.
  - Реализуйте свойства и методы характерные массиву (`length`, `push`, `pop`, `slice`, `join`, etc)
  - Задание творческое. Суть заключается в том чтобы пояснить как функционирует базовый `Array`. По этому не нужно реализовывать все методы что есть в `Array`. 3-5 методов достаточно. Лучше выберите самые сложные для себя.
  - Напишите небольшой скрипт с использование своего класса. Покажите что методы экземпляра класса `Massiv` работают так же как и методы экземпляров класса `Array`. */

function exercise_4 () {
    //
}

msg (4, exercise_4());